In [1]:
'''Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.'''

import pandas as pd 

pd_series=pd.Series([4, 8, 15, 16, 23, 42])

pd_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [2]:
'''Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.'''

l=["sahil",12,34,"b",'c','d',1,2,3,4]

pd.Series(l)

0    sahil
1       12
2       34
3        b
4        c
5        d
6        1
7        2
8        3
9        4
dtype: object

In [3]:
'''Q3. Create a Pandas DataFrame that contains the following data:'''

import pandas as pd

# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25,30,27],
    'Gender': ['Female','Male','Female']
}

df = pd.DataFrame(data)
print(df)

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

In [4]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [5]:
'''Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.'''

pd.Series([4, 8, 15, 16, 23, 42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
d = {'col1': pd.Series([5,6,7,8]), 'col2': pd.Series([2, 3], index=[2, 3])}
pd.DataFrame(data=d, index=[0, 1, 2, 3])

   col1  col2
0     5   NaN
1     6   NaN
2     7   2.0
3     8   3.0

In [ ]:
# hence we can say that a pd.series is some type of list in which the index of the elements is visivble to us and
# dataframe is reffered as a set of multiple pd.series which provide data in a tabular form

In [ ]:
''' Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?'''

1.drop()- to delete a row or column
2.head()-to obtain first five  data 
3.tail()-to obtain last five data
4.describe()- to obtain many mathematical info
5.loc() and iloc()-

In [ ]:
''' Q6. Which of the following is mutable in nature Series, DataFrame, Panel?'''

# dataframe

In [7]:
'''Q7. Create a DataFrame using multiple Series. Explain with an example. '''

d = {'col1': pd.Series([5,6,7,8]), 'col2': pd.Series([2, 3], index=[2, 3]), 'col3': pd.Series([12,34,5,6])}
pd.DataFrame(data=d, index=[0, 1, 2, 3])

   col1  col2  col3
0     5   NaN    12
1     6   NaN    34
2     7   2.0     5
3     8   3.0     6